rust/bench/configs/devnet-fixture-100k-usdg.yml
# Reusable deterministic wallet fixture for the public devnet Pingora gate,
# funded in USDG instead of USDC. Uses its own `--id` (see below) so it
# derives a distinct 100k-wallet set from `devnet-fixture-100k.yml` rather
# than colliding with any wallets already provisioned under `devnet-100k`.
#
# This is a spend plan, not a load profile. `bench setup --id devnet-100k-usdg`
# derives every wallet from BENCH_FUNDER_KEYPAIR + the stable ID, so a later
# `bench teardown devnet-100k-usdg` can close the exact same ATAs and reclaim
# rent.
setup:
  name: devnet-100k-usdg
  network: devnet
  rpc_url_env: BENCH_DEVNET_RPC_URL
  funder:
    keypair_env: BENCH_FUNDER_KEYPAIR
  users: 100000
  # Enough SOL for the payer side of a real payment-channel open; ATA rent is
  # separately estimated and included in max_total_sol before setup begins.
  sol_lamports_per_user: 5000000
  max_total_sol: 1000.0

# Conservative starting policy for public-cluster smoke tests. The 100k run
# requires a dedicated RPC endpoint and the staged recovery gates in the plan.
execution:
  window_users: 32
  reconcile_concurrency: 8
  submit_concurrency: 1
  rpc_requests_per_second: 20
  rpc_burst: 5
  request_timeout_seconds: 15
  confirmation_timeout_seconds: 90
  max_attempts: 8
  initial_backoff_ms: 250
  max_backoff_ms: 10000
  jitter_ratio: 0.20

assets:
  # Devnet USDG, Token-2022. 0.01 x 100,000 means the funder needs 1,000 USDG
  # (the funder is expected to hold ~10,000 USDG of headroom).
  - label: USDG
    mint: 4F6PM96JJxngmHnZLBh9n58RH4aTVNWvDs2nuwrT5BP7
    token_program: TokenzQdBNbLqP5VEhdkAS6EPFLC1PHnBqCXEpPxuEb
    decimals: 6
    amount_per_user: "0.01"
    max_total_amount: "1000"