rust/bench/configs/devnet-fixture-100k-usdtest.yml
# Add USDtest accounts to the retained 100,000-wallet cohort without colliding
# with its USDG setup journal. `wallet_set_id` is the deterministic derivation
# namespace; the CLI `--id` remains the independent USDtest lifecycle journal.
setup:
  name: devnet-100k-usdtest
  wallet_set_id: devnet-100k-usdg
  network: devnet
  rpc_url_env: BENCH_DEVNET_RPC_URL
  funder:
    keypair_env: BENCH_FUNDER_KEYPAIR
  users: 100000
  # SOL remains owned by the retained USDG fixture; this overlay only creates
  # the USDtest Token-2022 accounts and therefore must not sweep wallet SOL.
  sol_lamports_per_user: 0
  max_total_sol: 250.0

execution:
  window_users: 64
  reconcile_concurrency: 32
  submit_concurrency: 32
  rpc_requests_per_second: 100
  rpc_burst: 32
  request_timeout_seconds: 15
  confirmation_timeout_seconds: 90
  max_attempts: 8
  initial_backoff_ms: 250
  max_backoff_ms: 10000
  jitter_ratio: 0.20

assets:
  # Devnet-only USDtest, Token-2022. 10 x 100,000 requires 1,000,000 USDtest.
  - label: USDtest
    mint: 6MJyWHwFpPsaTEuYarEz49ngtsSKPYn6yHqtJUW2a9St
    token_program: TokenzQdBNbLqP5VEhdkAS6EPFLC1PHnBqCXEpPxuEb
    decimals: 6
    amount_per_user: "10"
    max_total_amount: "1000000"